IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l11xx_l13xx/I2C1_1.0.xml
See field decoding in Table: MCTR Field decoding." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="The last received data byte of a transaction is not acknowledged automatically by the master."/>
                <bitenum id="ENABLE" value="0x1" description="The last received data byte of a transaction is acknowledged automatically by the master."/>
            </bitfield>
            <bitfield id="MBLEN" description="I2C transaction length
This field contains the programmed length of bytes of the Transaction." begin="27" end="16" width="12" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFFF" description="Highest possible value"/>
            </bitfield>
            <bitfield id="MACKOEN" description="Master ACK overrride Enable" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When 1 and the master is receiving data and the number of bytes indicated in MBLEN have been received, the state machine will generate an rxdone interrupt and wait at the start of the ACK for FW to indicate if an ACK or NACK should be sent. The ACK or NACK is selected by writing the MCTR register and setting ACK accordingly. The other fields in this register can also be written at this time to continue on with the transaction. If a NACK is sent the state machine will automatically send a Stop."/>
            </bitfield>
            <bitfield id="RD_ON_TXEMPTY" description="Read on TX Empty" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When 1 the master will transmit all bytes from the TX FIFO before continuing with the programmed Burst Run Read. If the DIR is not set to Read in the MSA then this bit is ignored. The Start must be set in the MCTR for proper I2C protocol. The master will first send the Start Condition, I2C Address with R/W bit set to write, before sending the bytes in the TX FIFO. When the TX FIFO is empty, the I2C transaction will continue as programmed in MTCR and MSA without sending a Stop Condition. This is intended to be used to perform simple I2C command based reads transition that will complete after initiating them without having to get an interrupt to turn the bus around."/>
            </bitfield>
        </register>
        <register id="I2C1_MSR" width="32" offset="0x8" description="I2C Master Status Register">
            <bitfield id="BUSY" description="I2C Master FSM Busy
The BUSY bit is set during an ongoing transaction, so is set during the transmit/receive of the amount of data set in MBLEN including START, RESTART, Address and STOP signal generation when required for the current transaction." begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The controller is idle."/>
                <bitenum id="SET" value="0x1" description="The controller is busy."/>
            </bitfield>
            <bitfield id="ERR" description="Error 
The error can be from the slave address not being acknowledged or the transmit data not being acknowledged." begin="1" end="1" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="No error was detected on the last operation."/>
                <bitenum id="SET" value="0x1" description="An error occurred on the last operation."/>
            </bitfield>
            <bitfield id="ADRACK" description="Acknowledge Address" begin="2" end="2" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The transmitted address was acknowledged"/>
                <bitenum id="SET" value="0x1" description="The transmitted address was not acknowledged."/>
            </bitfield>
            <bitfield id="DATACK" description="Acknowledge Data" begin="3" end="3" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The transmitted data was acknowledged"/>
                <bitenum id="SET" value="0x1" description="The transmitted data was not acknowledged."/>
            </bitfield>
            <bitfield id="ARBLST" description="Arbitration Lost" begin="4" end="4" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The I2C controller won arbitration."/>
                <bitenum id="SET" value="0x1" description="The I2C controller lost arbitration."/>
            </bitfield>
            <bitfield id="IDLE" description="I2C Idle" begin="5" end="5" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The I2C controller is not idle."/>
                <bitenum id="SET" value="0x1" description="The I2C controller is idle."/>
            </bitfield>
            <bitfield id="BUSBSY" description="I2C Bus is Busy
Master State Machine will wait until this bit is cleared before starting a transaction. When first enabling the Master in multi master environments, FW should wait for one I2C clock period after setting ACTIVE high before writing to the MTCR register to start the transaction so that if SCL goes low it will trigger the BUSBSY." begin="6" end="6" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The I2C bus is idle."/>
                <bitenum id="SET" value="0x1" description="'This Status bit is set on a START or when SCL goes low. It is cleared on a STOP,  or when a SCL high bus busy timeout occurs and SCL and SDA are both high. This status is cleared when the ACTIVE bit is low.   Note that the Master State Machine will wait until this bit is cleared before starting an I2C transaction. When first enabling the Master in multi master environments, FW should wait for one I2C clock period after setting ACTIVE high before writing to the MTCR register to start the transaction so that if SCL goes low it will trigger the BUSBSY."/>
            </bitfield>
            <bitfield id="MBCNT" description="I2C Master Transaction Count
This field contains the current count-down value of the transaction." begin="27" end="16" width="12" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C1_MRXDATA" width="32" offset="0xC" description="I2C Master RXData">
            <bitfield id="VALUE" description="Received Data. 
This field contains the last received data." begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C1_MTXDATA" width="32" offset="0x10" description="I2C Master TXData">
            <bitfield id="VALUE" description="Transmit Data
This byte contains the data to be transferred during the next transaction." begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C1_MTPR" width="32" offset="0x14" description="I2C Master Timer Period">
            <bitfield id="TPR" description="Timer Period 
This field is used in the equation to configure SCL_PERIOD :
SCL_PERIOD = (1 + TPR ) * (SCL_LP + SCL_HP ) * INT_CLK_PRD
where: 
  SCL_PRD is the SCL line period (I2C clock).
  